Repository: BravoBaldo/Translations
Catalog: Node-RED/OmegaT_NodeRed/OmegaT_NodeRed-level2.tmx
Source language: en_us
Languages: it_it

source: This guide assumes that you are already familiar with the basic usage of Node-RED.
it_it: Questa guida presuppone che si abbia già familiarità con l'utilizzo di base di Node-RED.

source: This guide describes how you can secure Node-RED.
it_it: Questa guida descrive come proteggere Node-RED.

source: This guide provides some recommendations and best practices for how to create Node-RED flows that will be reusable, easier to maintain and more robust.
it_it: Questa guida fornisce alcuni consigli e "best practice" su come creare flussi Node-RED riutilizzabili, più facili da gestire e più robusti.

source: This help can be formatted using Markdown and including lists, tables and links.
it_it: Questa guida può essere formattata utilizzando il Markdown e includere elenchi, tabelle e link.

source: This highlights an important principle: nodes should not modify or remove properties on messages that are not related to their functionality.
it_it: Questo evidenzia un principio importante: i nodi non devono modificare o rimuovere proprietà sui messaggi che non sono correlate alla loro funzionalità.

source: This is defined in the main *settings.js* file under the `functionGlobalContext` property.
it_it: Questo è definito nel file *settings.js* principale, sotto la proprietà `functionGlobalContext`.

source: This is expected to have a `username` property that is used to check against the list of valid users.
it_it: Ci si aspetta che abbia una proprietà `username` utilizzata per il controllo rispetto all'elenco degli utenti validi.

source: This is only suitable if you are running on a trusted network.
it_it: Questa opzione è adatta solo se si utilizza una rete attendibile.

source: This is where adding port labels can help document the intended logic.
it_it: È qui che l'aggiunta di etichette alle porte può aiutare a documentare la logica prevista.

source: This lets you pass messages out to multiple other flows, or have multiple flows pass messages into a single flow.
it_it: Ciò consente di inoltrare messaggi a più flussi o di far sì che più flussi inoltrino messaggi in un unico flusso.

source: This longer format of documentation is useful where more explanation is needed of a flow's purpose, or some more complex logic needs to be described.
it_it: Questo formato di documentazione più esteso è utile quando sono necessarie maggiori spiegazioni sullo scopo di un flusso o quando è necessario descrivere una logica più complessa.

source: This makes it easy to write a function that sends the message to different outputs depending on some condition.
it_it: Questo semplifica la scrittura di una funzione che invia il messaggio a output diversi a seconda di una condizione.

source: This makes it possible to integrate with existing authentication schemes.
it_it: Ciò consente l'integrazione con gli schemi di autenticazione esistenti.

source: This makes it possible to write generic functions that can handle variable number of outputs set from the edit dialog.
it_it: Questo consente di scrivere funzioni generiche in grado di gestire un numero variabile di output impostati dalla finestra di dialogo di modifica.

source: This may be convenient to keep the data together, but it can also lead to a lot of moving properties around as later nodes expect to operate on `msg.payload` and not a property underneath it.
it_it: Questo può essere comodo per mantenere i dati insieme, ma può anche portare a molti spostamenti di proprietà, poiché i nodi successivi si aspettano di operare su `msg.payload` e non su una proprietà sottostante.

source: This pattern can be applied to any node configuration field that lets you enter the value directly.
it_it: Questo pattern può essere applicato a qualsiasi campo di configurazione del nodo che consenta di immettere il valore direttamente.

source: This section considers the visual appearance of the flow layout.
it_it: Questa sezione prende in considerazione l'aspetto visivo del layout del flusso.

source: This section looks at how the design of messages can help create nodes and flows that work well together and are easier to maintain.
it_it: Questa sezione esamina come la progettazione dei messaggi possa contribuire a creare nodi e flussi che funzionino bene insieme e siano più facili da gestire.

source: This section looks at how you can organise your flows, strategies for splitting them into smaller, reusable components and how to customise them for different platforms.
it_it: Questa sezione illustra come organizzare i flussi, le strategie per suddividerli in componenti più piccoli e riutilizzabili e come personalizzarli per diverse piattaforme.

source: This section looks at some of the choices you need to make when deciding how to structure the messages in your flows.
it_it: Questa sezione esamina alcune delle scelte da effettuare quando si decide come strutturare i messaggi nei flussi.

source: This section looks at what tools and techniques Node-RED provides to help you document them.
it_it: Questa sezione esamina gli strumenti e le tecniche che Node-RED fornisce per aiutare a documentarli.

source: This should be used to properly label the key points of a flow.
it_it: Questa proprietà dovrebbe essere utilizzata per etichettare correttamente i punti chiave di un flusso.

source: This should be used with care as the icon is one of the main ways of identifying the type of a particular node
it_it: Questa operazione deve essere eseguita con attenzione, poiché l'icona è uno dei principali metodi per identificare il tipo di un particolare nodo.

source: This value, in seconds, is how long the runtime will allow the Function node to run for before raising an error.
it_it: Questo valore, in secondi, indica il tempo di esecuzione consentito al nodo Funzione prima di generare un errore.

source: This will allow the runtime to properly track messages through the system.
it_it: Ciò consentirà al runtime di tracciare correttamente i messaggi attraverso il sistema.

source: Those options do add an external dependency to manage and aren’t as conveniently integrated as Context, but they can also be used alongside context and not as a complete replacement.
it_it: Queste opzioni aggiungono una dipendenza esterna da gestire e non sono integrate in modo così pratico come Context, ma possono anche essere utilizzate insieme a Context e non come una sostituzione completa.

source: Tidying up
it_it: Riordino

source: To access the editor using a custom token without the login prompt, add `?access_token=<ACCESS_TOKEN>` to the URL.
it_it: Per accedere all'editor utilizzando un token personalizzato senza il prompt di accesso, aggiungere `?access_token=<ACCESS_TOKEN>` all'URL.

source: To change that, use the `target` command:
it_it: Per modificare questa impostazione, utilizzare il comando `target`:

source: To do this, the `default` property can be added to the `adminAuth` setting to define the default user:
it_it: A tale scopo, è possibile aggiungere la proprietà `default` all'impostazione `adminAuth` per definire l'utente di default:

source: To do this:
it_it: Per fare ciò:

source: To enable access to the Node-RED Editor over HTTPS, rather than the default HTTP, you can use the `https` configuration option in your [settings file](settings-file).
it_it: Per abilitare l'accesso all'editor di Node-RED tramite HTTPS, anziché tramite l'HTTP di default, è possibile utilizzare l'opzione di configurazione `https` nel [file delle impostazioni](settings-file).

source: To enable user authentication on the Editor and Admin API, uncomment the `adminAuth` property in your [settings file](settings-file):
it_it: Per abilitare l'autenticazione utente sull'Editor e l'API Admin, rimuovere il commento dalla proprietà `adminAuth` nel [file delle impostazioni](settings-file):

source: To get a value from context:
it_it: Per ottenere un valore dal contesto:

source: To help it do so, the Function node should call `node.done()` at the appropriate time.
it_it: Per facilitare questa operazione, il nodo Funzione dovrebbe chiamare `node.done()` al momento opportuno.

source: To remotely administer a Node-RED instance, the tool must first be pointed at the Node-RED instance you want it to access.
it_it: Per amministrare da remoto un'istanza di Node-RED, lo strumento deve prima puntare all'istanza di Node-RED a cui si desidera accedere.

source: To set a value:
it_it: Per impostare un valore:

source: To set the status, call the `node.status` function.
it_it: Per impostare lo stato, si chiama la funzione `node.status`.

source: To trigger a Catch node on the same tab, the function should call `node.error` with the original message as a second argument:
it_it: Per attivare un nodo Catch nella stessa scheda, la funzione dovrebbe chiamare `node.error` con il messaggio originale come secondo argomento:

source: To use `POST` requests instead, set `callbackMethod` to `POST`.
it_it: Per utilizzare invece le richieste `POST`, impostare `callbackMethod` su `POST`.

source: To use a different HTTP header, the `tokenHeader` setting can be used to identify which header to use:
it_it: Per utilizzare un header HTTP diverso, è possibile utilizzare l'impostazione `tokenHeader` per identificare l'header da utilizzare:

source: To use an external authentication source, Node-RED can take use a wide range of the strategies provided by [Passport](http://passportjs.org/).
it_it: Per utilizzare una fonte di autenticazione esterna, Node-RED può utilizzare un'ampia gamma di strategie fornite da [Passport](http://passportjs.org/).

source: To use the version included with `node-red`, use the command `node-red admin`.
it_it: Per utilizzare la versione inclusa in `node-red`, si usa il comando `node-red admin`.

source: Token expiration
it_it: Scadenza del token

source: Typically, this will be giving read-only access to the editor.
it_it: In genere, questo significa concedere l'accesso in sola lettura all'editor.

source: Usage Telemetry
it_it: Telemetria di utilizzo

source: Use node.warn() to show warnings in the sidebar to help you debug.
it_it: Utilizzare node.warn() per visualizzare gli avvisi nella barra laterale per facilitare il debug.

source: User permissions
it_it: Autorizzazioni utente

source: Username/password based authentication
it_it: autenticazione basata su nome utente/password

source: Using Node-RED
it_it: Utilizzo di Node-RED

source: Using Node-RED2:
it_it: Uso di Node-RED2:

source: Using `msg.topic`
it_it: Utilizzo di `msg.topic`

source: Using the `functionExternalModules` option
it_it: Utilizzo dell'opzione `functionExternalModules`

source: Using the `functionGlobalContext` option
it_it: Utilizzo dell'opzione `functionGlobalContext`

source: Using this configuration, the Node-RED process can avoid memory exhaustions even if the flows which start with the http-in node take time to process.
it_it: Utilizzando questa configurazione, il processo Node-RED può evitare esaurimenti di memoria anche se i flussi che iniziano con il nodo http-in richiedono tempo per l'elaborazione.

source: We do not currently support refreshing the token to extend this period.
it_it: Al momento non supportiamo l'aggiornamento del token per estendere questo periodo.

source: When a flow gets too long, arranging some nodes vertically can be used to good effect.
it_it: Quando un flusso diventa troppo lungo, è possibile utilizzare con successo la disposizione verticale di alcuni nodi.

source: When a user edits an individual instance they can then provide a custom value for `MY_TOPIC` for that instance.
it_it: Quando un utente modifica una singola istanza, può quindi fornire un valore personalizzato per `MY_TOPIC` per quell'istanza.

source: When creating flows, the choice of properties used on a message will largely be determined by what the nodes in the flow require.
it_it: Quando si creano flussi, la scelta delle proprietà utilizzate per un messaggio sarà determinata in gran parte dalle esigenze dei nodi nel flusso.

source: When creating subflows, you may want to be able to customise their behaviour in some way.
it_it: Quando si creano `Subflow`, potrebbe essere necessario personalizzarne il comportamento in qualche modo.

source: When designing a node or subflow for reuse, the message properties it works with and the properties it sets are all part of the API it exposes.
it_it: Quando si progetta un nodo o un `Subflow` per il riutilizzo, le proprietà del messaggio con cui funziona e le proprietà che imposta fanno tutte parte dell'API che espone.

source: When multiple messages are returned for an output, subsequent nodes will receive the messages one at a time in the order they were returned.
it_it: Quando vengono restituiti più messaggi per un output, i nodi successivi riceveranno i messaggi uno alla volta nell'ordine in cui sono stati restituiti.

source: When reaching the limitation, the endpoints will return the default message, "Too many requests, please try again later.".
it_it: Al raggiungimento del limite, gli endpoint restituiranno il messaggio di default, "Too many requests, please try again later.".

source: When you first start using Node-RED, you probably start adding all of your nodes to the same tab in the editor.
it_it: Quando si inizia ad utilizzare Node-RED, probabilmente si comincia ad aggiungere tutti i nodi nello stesso "tab" [scheda] nell'editor.

source: When you write documentation, the act of writing out the behaviour could well help you identify parts that could be improved.
it_it: Quando si scrive la documentazione, l'atto di descriverne il comportamento potrebbe aiutare a identificare le parti che potrebbero essere migliorate.

source: Where the console output appears will depend on how your operating system and how you start Node-RED.
it_it: La posizione in cui appare l'output della console dipenderà dal sistema operativo in uso e da come si avvia Node-RED.

source: Which ever approach you choose, try to be consistent across your different flows.
it_it: Qualunque approccio si scelga, è importante cercare di essere coerenti tra i diversi flussi.

source: Whilst everything may seem obvious as you are building a flow, your future self will thank you for providing some description of the details when you come back to it later.
it_it: Sebbene tutto possa sembrare ovvio durante la creazione di un flusso, in futuro sarete grati a voi stessi per aver fornito una descrizione dettagliata quando ci tornerete in seguito.

source: Whilst the default labels may be sufficient in the context of the flow itself, it is also possible to customise labels to provide more detailed information.
it_it: Sebbene le etichette di default possano essere sufficienti nel contesto del flusso stesso, è anche possibile personalizzarle per fornire informazioni più dettagliate.

source: Whilst your flow may not use nodes that depend on `msg.topic` directly, it can be used to give extra contextual information about a message.
it_it: Sebbene il flusso non utilizzi nodi che dipendono direttamente da `msg.topic`, può essere utilizzato per fornire informazioni contestuali aggiuntive su un messaggio.

source: With 0.19 it is possible to configure multiple context stores.
it_it: Con la versione 0.19 è possibile configurare context store multipli.

source: With the 1.1.0 release, the Function node provides an `On Start` tab (labeled `Setup` before 1.3.0) where you can provide code that will run whenever the node is started.
it_it: Con la versione 1.1.0, il nodo Funzione offre una scheda `On Start` (denominata `Setup` prima della versione 1.3.0) in cui è possibile specificare il codice che verrà eseguito all'avvio del nodo.

source: With the `adminAuth` property set, the [Admin API documentation](/docs/api/admin/oauth) describes how to access the API.
it_it: Con la proprietà `adminAuth` impostata, la [documentazione dell'API di Admin](/docs/api/admin/oauth) descrive come accedere all'API.

source: Without a name set, you have to use the Link node's internal ID when creating links between different tabs.
it_it: Senza un nome impostato, è necessario utilizzare l'ID interno del nodo Link quando si creano collegamenti tra diverse schede.

source: Working with `msg.payload`
it_it: Lavorare con `msg.payload`

source: Writing a Function
it_it: Scrivere una Funzione

source: You *must* be using Node.js 11 or later
it_it: È *necessario* utilizzare Node.js 11 o versione successiva

source: You also specify the variable that will be used to refer to the module in the node's code.
it_it: È inoltre possibile specificare la variabile che verrà utilizzata per fare riferimento al modulo nel codice del nodo.

source: You can do this in two different ways.
it_it: È possibile farlo in due modi diversi.

source: You can now configure number of outputs solely via edit dialog without making changes to the function itself.
it_it: Ora è possibile configurare il numero di output esclusivamente tramite la finestra di dialogo di modifica, senza apportare modifiche alla funzione stessa.

source: You can then add new instances of the subflow wherever you would a normal node.
it_it: È quindi possibile aggiungere nuove istanze del `Subflow` ovunque si aggiungerebbe un nodo normale.

source: You may import some example flows others have shared, or build prototype flows to test different things out.
it_it: Si potrebbero importare alcuni flussi di esempio condivisi da altri o creare flussi prototipo per testare diverse soluzioni.

source: You should also choose context variable names with care - make sure they are descriptive and easy to identify.
it_it: È inoltre consigliabile scegliere con cura i nomi delle variabili di contesto: assicurarsi che siano descrittivi e facili da identificare.

source: You should avoid having multiple copies of those common parts spread across your flows as they become harder to maintain - you end up with multiple places to apply fixes and could easily overlook one.
it_it: Si dovrebbe evitare di avere più copie di queste parti comuni sparse nei flussi, poiché diventano più difficili da gestire: ci si ritroverebbe con più punti in cui applicare le correzioni e se ne potrebbe facilmente trascurarne una.

source: You should make sure the purpose of each node is easily identified and that they are well laid out to minimise how much wires cross each other.
it_it: Si dovrebbe far sì che lo scopo di ciascun nodo sia facilmente identificabile e che siano ben disposti per ridurre al minimo il numero di collegamenti che si incrociano.

source: You want to integrate Node-RED into an existing system where the users will already be logged in and you don't want them to have to log in again when accessing the editor
it_it: Per integrare Node-RED in un sistema esistente in cui gli utenti saranno già connessi e non si desidera che debbano effettuare nuovamente l'accesso quando accedono all'editor.

source: You want to use OAuth based user authentication, but you also require automated access to the admin API which cannot perform the interactive authentication steps OAuth requires
it_it: Si può utilizzare l'autenticazione utente basata su OAuth, ma è anche necessario un accesso automatizzato all'API di amministrazione, che non può eseguire i passaggi di autenticazione interattiva richiesti da OAuth.

source: [Adding nodes to the palette](/docs/user-guide/runtime/adding-nodes)
it_it: [Aggiunta di nodi alla palette](/docs/user-guide/runtime/adding-nodes)

source: [Command-line Admin](/docs/user-guide/node-red-admin)
it_it: [Amministratore da riga di comando](/docs/user-guide/node-red-admin)

source: [Configuration options](/docs/user-guide/runtime/configuration)
it_it: [Opzioni di configurazione](/docs/user-guide/runtime/configuration)

source: [Configuring Node-RED](/docs/user-guide/configuration)
it_it: [Configurazione di Node-RED](/docs/user-guide/configuration)

source: [Creating your first flow](/docs/tutorials/first-flow)
it_it: [Creazione del primo flusso](/docs/tutorials/first-flow)

source: [Documenting flows](documenting-flows)
it_it: [Documentazione dei Flussi](documenting-flows)

source: [Embedding into an existing app](/docs/user-guide/runtime/embedding)
it_it: [Embedding in un'app esistente](/docs/user-guide/runtime/embedding)

source: [Enabling HTTPS access](#enabling-https-access)
it_it: [Abilitazione dell'accesso HTTPS](#enabling-https-access)

source: [Flow structure](flow-structure)
it_it: [Struttura dei Flussi](flow-structure)

source: [Handling errors](/docs/user-guide/handling-errors)
it_it: [Gestione degli errori](/docs/user-guide/handling-errors)

source: [Installing Node-RED](/docs/getting-started)
it_it: [Installazione di Node-RED](/docs/getting-started)

source: [Message design](message-design)
it_it: [Progettazione dei Messaggi](message-design)

source: [Node-RED Concepts](/docs/user-guide/concepts)
it_it: [Concetti di Node-RED](/docs/user-guide/concepts)

source: [Securing Node-RED](/docs/user-guide/runtime/securing-node-red)
it_it: [Protezione di Node-RED](/docs/user-guide/runtime/securing-node-red)

source: [Securing the HTTP Nodes and Node-RED Dashboard](#http-node-security)
it_it: [Protezione dei nodi HTTP e della Dashboard di Node-RED](#http-node-security)

source: [Securing the editor and admin API](#editor--admin-api-security)
it_it: [Protezione dell'editor e dell'API di amministrazione](#editor--admin-api-security)

source: [The Settings file](/docs/user-guide/runtime/settings-file)
it_it: [File delle Settings](/docs/user-guide/runtime/settings-file)

source: [The core nodes](/docs/user-guide/nodes)
it_it: [I nodi principali](/docs/user-guide/nodes)

source: [Usage Telemetry](/docs/telemetry)
it_it: [Telemetria di utilizzo](/docs/telemetry)

source: [Using environment variables](/docs/user-guide/environment-variables)
it_it: [Utilizzo delle variabili d'ambiente](/docs/user-guide/environment-variables)

source: [Using the Function node](/docs/user-guide/writing-functions)
it_it: [Utilizzo del nodo Funzione](/docs/user-guide/writing-functions)

source: [Using the Node-RED Editor](/docs/user-guide/editor)
it_it: [Utilizzo dell'editor di Node-RED](/docs/user-guide/editor)

source: [Working with context](/docs/user-guide/context)
it_it: [Lavorare con il contesto](/docs/user-guide/context)

source: [Working with messages](/docs/user-guide/messages)
it_it: [Lavorare con i messaggi](/docs/user-guide/messages)

source: [Working with projects](/docs/user-guide/projects)
it_it: [Lavorare con i progetti](/docs/user-guide/projects)

source: `*` - full access
it_it: `*` - accesso completo

source: `Buffer` - the Node.js `Buffer` module
it_it: `Buffer` - il modulo `Buffer` di Node.js

source: `RED.util.cloneMessage(..)` : safely clones a message object so it can be reused
it_it: `RED.util.cloneMessage(..)` : clona in modo sicuro un oggetto messaggio in modo che possa essere riutilizzato

source: `autoLogin` - boolean, when `true` will automatically redirect to the authentication provider rather than asking the user to click a button.
it_it: `autoLogin` - booleano, quando `true` reindirizza automaticamente al provider di autenticazione anziché chiedere all'utente di fare clic su un pulsante.

source: `cert` - Cert chain in PEM format, provided as a `String` or `Buffer`
it_it: `cert` - Catena di certificati in formato PEM, fornita come `String` o `Buffer`

source: `console` - the Node.js `console` module (`node.log` is the preferred method of logging)
it_it: `console` - il modulo `console` di Node.js (`node.log` è il metodo di logging preferito)

source: `context.flow` : same as `flow`
it_it: `context.flow` : uguale a `flow`

source: `context.get(..)` : get a node-scoped context property
it_it: `context.get(..)` : ottiene una proprietà di contesto nello scope del nodo

source: `context.global` : same as `global`
it_it: `context.global` : uguale a `global`
